CSI API ETABS v1
cSapModel.SetPresentUnits Method
 Sets the present units.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPresentUnits(
	eUnits Units
)
Function SetPresentUnits (
	Units As eUnits
) As Integer
Dim instance As cSapModel
Dim Units As eUnits
Dim returnValue As Integer
returnValue = instance.SetPresentUnits(Units)
int SetPresentUnits(
	eUnits Units
)
abstract SetPresentUnits :
        Units : eUnits -> int
Parameters
Units
Type: ETABSv1.eUnits
 One of the items in the eUnits enumeration
Return Value
Type: Int32
 Returns zero if the units are successfully set and nonzero if they are not set.
Remarks
 Please note that the present units are for data transmitted through the API. They are independent of the units that are displayed in the GUI.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'set present units to KN-m
       ret = SapModel.SetPresentUnits(KN_m_C)
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get present units
       Dim presentUnits as eUnits
       presentUnits = SapModel.GetPresentUnits()
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace